import UIKit

/*
    1. Реализовать свой тип коллекции «очередь» (queue) c использованием дженериков.
    2. Добавить ему несколько методов высшего порядка, полезных для этой коллекции (пример: filter для массивов)
    3. * Добавить свой subscript, который будет возвращать nil в случае обращения к несуществующему индексу.*/






// MARK: 1. Реализовать свой тип коллекции «очередь» (queue) c использованием дженериков.







// MARK: 2. Добавить ему несколько методов высшего порядка, полезных для этой коллекции (пример: filter для массивов)







// MARK: 3. * Добавить свой subscript, который будет возвращать nil в случае обращения к несуществующему индексу.
